artillery/signup-test.yml
config:
  target: "http://localhost:3090/api"
  phases:
      # Bloque 1: ~2.000 requests
      - duration: 10
        arrivalRate: 20     # warmup
      - duration: 30
        arrivalRate: 50     # 10*20 + 30*50 = 200 + 1500 = 1700 aprox
      - duration: 6
        arrivalRate: 50     # +300 -> ~2.000

      # Bloque 2
      - duration: 10
        arrivalRate: 20
      - duration: 30
        arrivalRate: 50
      - duration: 6
        arrivalRate: 50

      # Bloque 3
      - duration: 10
        arrivalRate: 20
      - duration: 30
        arrivalRate: 50
      - duration: 6
        arrivalRate: 50

      # Bloque 4
      - duration: 10
        arrivalRate: 20
      - duration: 30
        arrivalRate: 50
      - duration: 6
        arrivalRate: 50

      # Bloque 5
      - duration: 10
        arrivalRate: 20
      - duration: 30
        arrivalRate: 50
      - duration: 6
        arrivalRate: 50
  payload:
    path: "users.csv"
    fields:
      - email
      - password
      - name
      - lastname
      - uuid
      - dni
      - phone
      - occupation
      - instagram
      - user_location
      - birth_date
      - notification_token
    order: sequence   
    skipHeader: true  
  processor: "log-response.js"
  defaults:
    headers:
      content-type: "application/json"

scenarios:
  - flow:
      - post:
          url: "/users/signup"
          beforeRequest: "normalizeTypes"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            name: "{{ name }}"
            lastname: "{{ lastname }}"
            uuid: "{{ uuid }}"
            dni: "{{ dni }}"
            phone: "{{ phone }}"
            occupation: "{{ occupation }}"
            instagram: "{{ instagram }}"
            user_location: "{{ user_location }}"
            birth_date: "{{ birth_date }}"
            notification_token: "{{ notification_token }}"
          afterResponse: "logResponse"